MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4455/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF4455_H_
#define _PIC18LF4455_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18LF4455
 */
#ifndef _XC_H_
#warning Header file pic18lf4455.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: SPPDATA
#define SPPDATA SPPDATA
extern volatile unsigned char           SPPDATA             __at(0xF62);
#ifndef _LIB_BUILD
asm("SPPDATA equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :8;
    };
} SPPDATAbits_t;
extern volatile SPPDATAbits_t SPPDATAbits __at(0xF62);
// bitfield macros
#define _SPPDATA_DATA_POSN                                  0x0
#define _SPPDATA_DATA_POSITION                              0x0
#define _SPPDATA_DATA_SIZE                                  0x8
#define _SPPDATA_DATA_LENGTH                                0x8
#define _SPPDATA_DATA_MASK                                  0xFF

// Register: SPPCFG
#define SPPCFG SPPCFG
extern volatile unsigned char           SPPCFG              __at(0xF63);
#ifndef _LIB_BUILD
asm("SPPCFG equ 0F63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WS                     :4;
        unsigned CLK1EN                 :1;
        unsigned CSEN                   :1;
        unsigned CLKCFG                 :2;
    };
    struct {
        unsigned WS0                    :1;
        unsigned WS1                    :1;
        unsigned WS2                    :1;
        unsigned WS3                    :1;
        unsigned                        :2;
        unsigned CLKCFG0                :1;
        unsigned CLKCFG1                :1;
    };
} SPPCFGbits_t;
extern volatile SPPCFGbits_t SPPCFGbits __at(0xF63);
// bitfield macros
#define _SPPCFG_WS_POSN                                     0x0
#define _SPPCFG_WS_POSITION                                 0x0
#define _SPPCFG_WS_SIZE                                     0x4
#define _SPPCFG_WS_LENGTH                                   0x4
#define _SPPCFG_WS_MASK                                     0xF
#define _SPPCFG_CLK1EN_POSN                                 0x4
#define _SPPCFG_CLK1EN_POSITION                             0x4
#define _SPPCFG_CLK1EN_SIZE                                 0x1
#define _SPPCFG_CLK1EN_LENGTH                               0x1
#define _SPPCFG_CLK1EN_MASK                                 0x10
#define _SPPCFG_CSEN_POSN                                   0x5
#define _SPPCFG_CSEN_POSITION                               0x5
#define _SPPCFG_CSEN_SIZE                                   0x1
#define _SPPCFG_CSEN_LENGTH                                 0x1
#define _SPPCFG_CSEN_MASK                                   0x20
#define _SPPCFG_CLKCFG_POSN                                 0x6
#define _SPPCFG_CLKCFG_POSITION                             0x6
#define _SPPCFG_CLKCFG_SIZE                                 0x2
#define _SPPCFG_CLKCFG_LENGTH                               0x2
#define _SPPCFG_CLKCFG_MASK                                 0xC0
#define _SPPCFG_WS0_POSN                                    0x0
#define _SPPCFG_WS0_POSITION                                0x0
#define _SPPCFG_WS0_SIZE                                    0x1
#define _SPPCFG_WS0_LENGTH                                  0x1
#define _SPPCFG_WS0_MASK                                    0x1
#define _SPPCFG_WS1_POSN                                    0x1
#define _SPPCFG_WS1_POSITION                                0x1
#define _SPPCFG_WS1_SIZE                                    0x1
#define _SPPCFG_WS1_LENGTH                                  0x1
#define _SPPCFG_WS1_MASK                                    0x2
#define _SPPCFG_WS2_POSN                                    0x2
#define _SPPCFG_WS2_POSITION                                0x2
#define _SPPCFG_WS2_SIZE                                    0x1
#define _SPPCFG_WS2_LENGTH                                  0x1
#define _SPPCFG_WS2_MASK                                    0x4
#define _SPPCFG_WS3_POSN                                    0x3
#define _SPPCFG_WS3_POSITION                                0x3
#define _SPPCFG_WS3_SIZE                                    0x1
#define _SPPCFG_WS3_LENGTH                                  0x1
#define _SPPCFG_WS3_MASK                                    0x8
#define _SPPCFG_CLKCFG0_POSN                                0x6
#define _SPPCFG_CLKCFG0_POSITION                            0x6
#define _SPPCFG_CLKCFG0_SIZE                                0x1
#define _SPPCFG_CLKCFG0_LENGTH                              0x1
#define _SPPCFG_CLKCFG0_MASK                                0x40
#define _SPPCFG_CLKCFG1_POSN                                0x7
#define _SPPCFG_CLKCFG1_POSITION                            0x7
#define _SPPCFG_CLKCFG1_SIZE                                0x1
#define _SPPCFG_CLKCFG1_LENGTH                              0x1
#define _SPPCFG_CLKCFG1_MASK                                0x80

// Register: SPPEPS
#define SPPEPS SPPEPS
extern volatile unsigned char           SPPEPS              __at(0xF64);
#ifndef _LIB_BUILD
asm("SPPEPS equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDR                   :4;
        unsigned SPPBUSY                :1;
        unsigned                        :1;
        unsigned WRSPP                  :1;
        unsigned RDSPP                  :1;
    };
    struct {
        unsigned ADDR0                  :1;
        unsigned ADDR1                  :1;
        unsigned ADDR2                  :1;
        unsigned ADDR3                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned BUSY                   :1;
    };
} SPPEPSbits_t;
extern volatile SPPEPSbits_t SPPEPSbits __at(0xF64);
// bitfield macros
#define _SPPEPS_ADDR_POSN                                   0x0
#define _SPPEPS_ADDR_POSITION                               0x0
#define _SPPEPS_ADDR_SIZE                                   0x4
#define _SPPEPS_ADDR_LENGTH                                 0x4
#define _SPPEPS_ADDR_MASK                                   0xF
#define _SPPEPS_SPPBUSY_POSN                                0x4
#define _SPPEPS_SPPBUSY_POSITION                            0x4
#define _SPPEPS_SPPBUSY_SIZE                                0x1
#define _SPPEPS_SPPBUSY_LENGTH                              0x1
#define _SPPEPS_SPPBUSY_MASK                                0x10
#define _SPPEPS_WRSPP_POSN                                  0x6
#define _SPPEPS_WRSPP_POSITION                              0x6
#define _SPPEPS_WRSPP_SIZE                                  0x1
#define _SPPEPS_WRSPP_LENGTH                                0x1
#define _SPPEPS_WRSPP_MASK                                  0x40
#define _SPPEPS_RDSPP_POSN                                  0x7
#define _SPPEPS_RDSPP_POSITION                              0x7
#define _SPPEPS_RDSPP_SIZE                                  0x1
#define _SPPEPS_RDSPP_LENGTH                                0x1
#define _SPPEPS_RDSPP_MASK                                  0x80
#define _SPPEPS_ADDR0_POSN                                  0x0
#define _SPPEPS_ADDR0_POSITION                              0x0
#define _SPPEPS_ADDR0_SIZE                                  0x1
#define _SPPEPS_ADDR0_LENGTH                                0x1
#define _SPPEPS_ADDR0_MASK                                  0x1
#define _SPPEPS_ADDR1_POSN                                  0x1
#define _SPPEPS_ADDR1_POSITION                              0x1
#define _SPPEPS_ADDR1_SIZE                                  0x1
#define _SPPEPS_ADDR1_LENGTH                                0x1
#define _SPPEPS_ADDR1_MASK                                  0x2
#define _SPPEPS_ADDR2_POSN                                  0x2
#define _SPPEPS_ADDR2_POSITION                              0x2
#define _SPPEPS_ADDR2_SIZE                                  0x1
#define _SPPEPS_ADDR2_LENGTH                                0x1
#define _SPPEPS_ADDR2_MASK                                  0x4
#define _SPPEPS_ADDR3_POSN                                  0x3
#define _SPPEPS_ADDR3_POSITION                              0x3
#define _SPPEPS_ADDR3_SIZE                                  0x1
#define _SPPEPS_ADDR3_LENGTH                                0x1
#define _SPPEPS_ADDR3_MASK                                  0x8
#define _SPPEPS_BUSY_POSN                                   0x4
#define _SPPEPS_BUSY_POSITION                               0x4
#define _SPPEPS_BUSY_SIZE                                   0x1
#define _SPPEPS_BUSY_LENGTH                                 0x1
#define _SPPEPS_BUSY_MASK                                   0x10

